# Задайте список из нескольких чисел. Напишите программу, которая найдёт
# сумму элементов списка, стоящих на нечётной позиции.
# Пример: - [2, 3, Home_Task_5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

array = [2, 3, 5, 9, 3, 4, 7, 12, 9, 8, 1]

for i in array:
    if i == 11:
        print(i)